Merge pull request #8 from danismith-slalom1/gitlab
Add gitlab agent and update readme
